GopalSaraf/Practicals/PSDL/include/proc/pic18f6680.inc
// Register: TXB1D7
#define TXB1D7 TXB1D7
TXB1D7                                   equ 0F3Dh
// bitfield definitions
TXB1D7_TXB1D70_POSN                      equ 0000h
TXB1D7_TXB1D70_POSITION                  equ 0000h
TXB1D7_TXB1D70_SIZE                      equ 0001h
TXB1D7_TXB1D70_LENGTH                    equ 0001h
TXB1D7_TXB1D70_MASK                      equ 0001h
TXB1D7_TXB1D71_POSN                      equ 0001h
TXB1D7_TXB1D71_POSITION                  equ 0001h
TXB1D7_TXB1D71_SIZE                      equ 0001h
TXB1D7_TXB1D71_LENGTH                    equ 0001h
TXB1D7_TXB1D71_MASK                      equ 0002h
TXB1D7_TXB1D72_POSN                      equ 0002h
TXB1D7_TXB1D72_POSITION                  equ 0002h
TXB1D7_TXB1D72_SIZE                      equ 0001h
TXB1D7_TXB1D72_LENGTH                    equ 0001h
TXB1D7_TXB1D72_MASK                      equ 0004h
TXB1D7_TXB1D73_POSN                      equ 0003h
TXB1D7_TXB1D73_POSITION                  equ 0003h
TXB1D7_TXB1D73_SIZE                      equ 0001h
TXB1D7_TXB1D73_LENGTH                    equ 0001h
TXB1D7_TXB1D73_MASK                      equ 0008h
TXB1D7_TXB1D74_POSN                      equ 0004h
TXB1D7_TXB1D74_POSITION                  equ 0004h
TXB1D7_TXB1D74_SIZE                      equ 0001h
TXB1D7_TXB1D74_LENGTH                    equ 0001h
TXB1D7_TXB1D74_MASK                      equ 0010h
TXB1D7_TXB1D75_POSN                      equ 0005h
TXB1D7_TXB1D75_POSITION                  equ 0005h
TXB1D7_TXB1D75_SIZE                      equ 0001h
TXB1D7_TXB1D75_LENGTH                    equ 0001h
TXB1D7_TXB1D75_MASK                      equ 0020h
TXB1D7_TXB1D76_POSN                      equ 0006h
TXB1D7_TXB1D76_POSITION                  equ 0006h
TXB1D7_TXB1D76_SIZE                      equ 0001h
TXB1D7_TXB1D76_LENGTH                    equ 0001h
TXB1D7_TXB1D76_MASK                      equ 0040h
TXB1D7_TXB1D77_POSN                      equ 0007h
TXB1D7_TXB1D77_POSITION                  equ 0007h
TXB1D7_TXB1D77_SIZE                      equ 0001h
TXB1D7_TXB1D77_LENGTH                    equ 0001h
TXB1D7_TXB1D77_MASK                      equ 0080h

// Register: CANSTAT_RO2
#define CANSTAT_RO2 CANSTAT_RO2
CANSTAT_RO2                              equ 0F3Eh
// bitfield definitions
CANSTAT_RO2_EICODE0_POSN                 equ 0000h
CANSTAT_RO2_EICODE0_POSITION             equ 0000h
CANSTAT_RO2_EICODE0_SIZE                 equ 0001h
CANSTAT_RO2_EICODE0_LENGTH               equ 0001h
CANSTAT_RO2_EICODE0_MASK                 equ 0001h
CANSTAT_RO2_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO2_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO2_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO2_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO2_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO2_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO2_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO2_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO2_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO2_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO2_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO2_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO2_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO2_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO2_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO2_EICODE4_POSN                 equ 0004h
CANSTAT_RO2_EICODE4_POSITION             equ 0004h
CANSTAT_RO2_EICODE4_SIZE                 equ 0001h
CANSTAT_RO2_EICODE4_LENGTH               equ 0001h
CANSTAT_RO2_EICODE4_MASK                 equ 0010h
CANSTAT_RO2_OPMODE0_POSN                 equ 0005h
CANSTAT_RO2_OPMODE0_POSITION             equ 0005h
CANSTAT_RO2_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO2_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO2_OPMODE0_MASK                 equ 0020h
CANSTAT_RO2_OPMODE1_POSN                 equ 0006h
CANSTAT_RO2_OPMODE1_POSITION             equ 0006h
CANSTAT_RO2_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO2_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO2_OPMODE1_MASK                 equ 0040h
CANSTAT_RO2_OPMODE2_POSN                 equ 0007h
CANSTAT_RO2_OPMODE2_POSITION             equ 0007h
CANSTAT_RO2_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO2_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO2_OPMODE2_MASK                 equ 0080h

// Register: CANCON_RO2
#define CANCON_RO2 CANCON_RO2
CANCON_RO2                               equ 0F3Fh
// bitfield definitions
CANCON_RO2_FP0_POSN                      equ 0000h
CANCON_RO2_FP0_POSITION                  equ 0000h
CANCON_RO2_FP0_SIZE                      equ 0001h
CANCON_RO2_FP0_LENGTH                    equ 0001h
CANCON_RO2_FP0_MASK                      equ 0001h
CANCON_RO2_WIN0_FP1_POSN                 equ 0001h
CANCON_RO2_WIN0_FP1_POSITION             equ 0001h
CANCON_RO2_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO2_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO2_WIN0_FP1_MASK                 equ 0002h
CANCON_RO2_WIN1_FP2_POSN                 equ 0002h
CANCON_RO2_WIN1_FP2_POSITION             equ 0002h
CANCON_RO2_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO2_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO2_WIN1_FP2_MASK                 equ 0004h
CANCON_RO2_WIN2_FP3_POSN                 equ 0003h
CANCON_RO2_WIN2_FP3_POSITION             equ 0003h
CANCON_RO2_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO2_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO2_WIN2_FP3_MASK                 equ 0008h
CANCON_RO2_ABAT_POSN                     equ 0004h
CANCON_RO2_ABAT_POSITION                 equ 0004h
CANCON_RO2_ABAT_SIZE                     equ 0001h
CANCON_RO2_ABAT_LENGTH                   equ 0001h
CANCON_RO2_ABAT_MASK                     equ 0010h
CANCON_RO2_REQOP0_POSN                   equ 0005h
CANCON_RO2_REQOP0_POSITION               equ 0005h
CANCON_RO2_REQOP0_SIZE                   equ 0001h
CANCON_RO2_REQOP0_LENGTH                 equ 0001h
CANCON_RO2_REQOP0_MASK                   equ 0020h
CANCON_RO2_REQOP1_POSN                   equ 0006h
CANCON_RO2_REQOP1_POSITION               equ 0006h
CANCON_RO2_REQOP1_SIZE                   equ 0001h
CANCON_RO2_REQOP1_LENGTH                 equ 0001h
CANCON_RO2_REQOP1_MASK                   equ 0040h
CANCON_RO2_REQOP2_POSN                   equ 0007h
CANCON_RO2_REQOP2_POSITION               equ 0007h
CANCON_RO2_REQOP2_SIZE                   equ 0001h
CANCON_RO2_REQOP2_LENGTH                 equ 0001h
CANCON_RO2_REQOP2_MASK                   equ 0080h

